<?php
return \common\models\Message::find()->select(['name', 'translate'])->where('lang_id = 3')->indexBy('name')->column();
/*
return [
    'Home' => 'Головна',
    'Увійти' =>'Увійти',
    'Вихід' => 'Вихід',
    'Блог' => 'Блог',
    'Про нас' => 'Про нас',
    'Контакти' => 'Контакти',
    'Реєстрація' => 'Реєстрація',
    
    'Купити' => 'Купить',
    'Продати' => 'Продать',
        'Викуп' => 'Викуп',
        'Комісія авто' => 'Комісія авто',
        'Гроші під заставу авто' => 'Гроші під заставу авто',
        'Traid-In' => 'Traid-In',
    'Замовити' => 'Замовити',
        'Авто із США' => 'Авто із США',
        'Авто із Європи' => 'Авто із Європи',
    'Послуги' => 'Послуги',
        'Кредит' => 'Кредит',
        'Страхування' => 'Страхування',
        'Фінансування' => 'Фінансування',
    'Лізинг' => 'Лізинг',
    'Про компанію' => 'Про компанію',
        'Про нас' => 'Про нас',
        'Вакансії' => 'Вакансії',
        'Персонал' => 'Персонал',
    'Контакти' => 'Контакти',
    
];
*/

